Revit 2015 API
Revision.NumberType Property
 Indicates what number type the Revision Number for this Revision should use.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public RevisionNumberType NumberType { get; set; }
Visual Basic
Public Property NumberType As RevisionNumberType
	Get
	Set
Visual C++
public:
property RevisionNumberType NumberType {
	RevisionNumberType get ();
	void set (RevisionNumberType value);
}
Remarks
 This property defines how the RevisionNumber will be assigned and displayed.
RevisionNumberType.Numeric: Numeric Revisions will use consecutive positive integers starting with 1.
RevisionNumberType.Alphabetic: Alphabetic Revisions will use consecutive strings generated from the RevisionAlphabet specified in the project's RevisionSettings.
RevisionNumberType.None: The Revision Number will always be the empty string.
 Revision numbers will always be assigned in revision sequence order.
 If the project contains a mix of Revision objects with different NumberTypes then the Revisions using a particular NumberType will always be assigned consecutive revision numbers. In other words, the first three numeric Revisions in the project will always be assigned revision numbers 1, 2, and 3, even if the revision sequence includes intervening Revisions that are alphabetic or not numbered.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This operation cannot be performed on Revisions that have already been issued.
See Also
Revision Class
Autodesk.Revit.DB Namespace